{"Crunch": {"name": "Crunch", "start_position": "Lying on the ground on your back with bent knees and feet flat on the ground. You can put your hands behind your head or on your chest.", "execution": {"main": "Contract your abs by raising your shoulders and upper back towards your knees. Keep your lower back firmly on the ground. Stay in the upright position for a second, then slowly return to the original position.", "steps": []}}, "Oblique Crunch": {"name": "Oblique Crunch", "start_position": "Lying on the ground on the right side with bent knees. Put your left hand behind your head and your right hand on your abs to feel them working.", "execution": {"main": "Contract your obliques on your left side by raising your shoulder towards your hip. Stay in the upright position for a second and then slowly return to the original position.", "steps": []}}, "Crunch Machine": {"name": "Crunch Machine", "start_position": "Sitting on the machine holding the handles.", "equipment_required": ["Crunch machine"], "execution": {"main": "Contract your abs and stay in position for a moment before slowly returning to the starting position.", "steps": []}}, "Rope Ab Pulldown": {"name": "Rope Ab Pulldown", "start_position": "Kneeling on the ground facing the high pulley. Grasp one end of the rope in each hand and bring them to the height of your head. Keep your hands in this position during the movement. Bend your torso so that it is almost parallel to the ground.", "equipment_required": ["Cable machine", "rope"], "execution": {"main": "Contract your abs by bringing your elbows back towards your knees. Stay in the contraction position for a moment before slowly returning to the initial position.", "steps": []}}, "Plank": {"name": "Plank", "start_position": "Lying face down on the floor. Balance yourself on your forearms and toes, keeping your shoulders and buttocks at the same height.", "execution": {"main": "Hold this position for the desired length of time while contracting your abs.", "steps": []}}, "Hanging Leg Raise": {"name": "Hanging Leg Raise", "start_position": "Hanging from a high bar, hands in pronation.", "execution": {"main": "Contract your abs by moving your knees and hips up towards your chest. Stay in the upright position for one second, then slowly return to the starting position.", "steps": []}}, "Bent Knee Reverse Crunch": {"name": "Bent Knee Reverse Crunch", "start_position": "Lie on your back with knees bent and feet flat on the ground. Place your arms on the ground beside you, and brace your abs.", "execution": {"main": "Keeping your upper back flat on the ground, raise your knees towards your chest, slightly lifting your hips from the ground. Pause, and then return your feet to the ground. Just before they touch the ground, repeat the movement.", "steps": []}}, "Long Arm Crunch": {"name": "Long Arm Crunch", "start_position": "Lie on your back with knees bent and feet flat on the ground. Place your arms above your head with your elbows in line with your ears. You can interlink your thumbs if it makes it easier for you.", "execution": {"main": "Keeping your elbows in line with your ears throughout the movement, raise your chest and shoulders off the ground. Pause, and then slowly lower yourself back down.", "steps": []}}, "Plank Get Ups": {"name": "Plank Get Ups", "start_position": "Get yourself into the standard push up position. Feet together, palms on the floor (shoulder width apart). Brace your abs and maintain a straight back.", "execution": {"main": "Slowly lower your right arm until the forearm is flat on the ground, then bring down your left arm. Once both forearms are on the ground, immediately raise your right arm back to a push up position followed by your left. This should all be done in one smooth movement, so that you are constantly in motion.", "steps": []}}}