{"Dumbbell Bent Over Row (Single Arm)": {"name": "Dumbbell Bent Over Row (Single Arm)", "start_position": "Place your left knee and left hand on the bench with your chest parallel to the floor. Keep your right foot on the ground and grasp the dumbbell still on the ground in your right hand in a neutral grip.", "equipment_required": ["Dumbbell", "Bench"], "execution": {"main": "Keeping your arm close to your body, lift the dumbbell as high as possible by raising your elbow and keeping your forearm perpendicular to the ground. Once your series is over, do the same with the other arm.", "steps": []}}, "Wide Grip Pulldown": {"name": "Wide Grip Pulldown", "start_position": "Sitting, thighs under the padded parts, the bar grasped in pronation, hands more apart than shoulder width. Keep elbows pointed outwards and back straight.", "equipment_required": ["Lat Pulldown Machine", "Lat Bar"], "execution": {"main": "Pull the bar up to your chin. Keep the contraction for a moment before slowly returning to the initial position. During the movement, do not let your elbows come forward.", "steps": []}}, "Seated Cable Row": {"name": "Seated Cable Row", "start_position": "Sitting on the machine's bench with your feet on the wedge. Grasp the double handle attached to the cable with both hands. Keep back straight and knees slightly bent.", "equipment_required": ["Cable Machine"], "execution": {"main": "Pull the load towards your abdomen. Tighten your back at the end of the movement by bringing your elbows as far back as possible. Then slowly return to the initial position.", "steps": []}}, "Close Grip Pulldown": {"name": "Close Grip Pulldown", "start_position": "Seated, thighs under the padded parts, the double handle grasped with both hands. Keep your back straight.", "equipment_required": ["Lat Pulldown Machine", "Lat Bar"], "execution": {"main": "Pull the load up to your upper chest without moving your elbows away from your body. Keep the contraction for a moment before slowly returning to the initial position.", "steps": []}}, "Barbell Row": {"name": "Barbell Row", "start_position": "Standing with slightly bent knees, grasping the bar with hands in pronation, grip wider than shoulder width. Bust bent forward, keep the back straight, the chest rounded.", "equipment_required": ["Barbell"], "execution": {"main": "Pull the load towards your abdomen. Tighten your back at the end of the movement, shoulders and elbows back. Then slowly return to the initial position.", "steps": []}}, "Behind Neck Pulldown": {"name": "Behind Neck Pulldown", "start_position": "Sitting, thighs under the padded parts, the bar grasped in pronation, hands more apart than shoulder width. Keep elbows pointed outwards and back straight.", "equipment_required": ["Lat Pulldown Machine", "Lat Bar"], "execution": {"main": "Pull the bar at the back of the neck. Keep the contraction for a moment before slowly returning to the initial position. During the movement, do not let your elbows come forward.", "steps": []}}, "Reverse Grip Pulldown": {"name": "Reverse Grip Pulldown", "start_position": "Seated, thighs under the padded parts, bar grasped in supination, hands shoulder-width apart. Keep your back straight.", "equipment_required": ["Lat Pulldown Machine", "Lat Bar"], "execution": {"main": "Pull the bar up to your upper chest. Keep the contraction for a moment, the shoulders well back before slowly returning to the initial position.", "steps": []}}, "Rope Pulldown": {"name": "Rope Pulldown", "start_position": "Standing facing the high pulley, knees slightly bent and bust slightly bent forward. Grasp one end of the rope in each hand in a neutral grip.", "equipment_required": ["Cable Machine", "Rope"], "execution": {"main": "Pull the rope up to your hips, letting your arms describe an arc of a circle. Keep your elbows slightly bent and close to your body. At the end of the movement, contract your back by squeezing your shoulders back, then return to the initial position.", "steps": []}}, "T-Bar Rows": {"name": "T-Bar Rows", "start_position": "Use a T-Bar machine (or place a barbell in the corner of a room). Stand with feet either side of the bar, bend your knees, and bow forward so that your chest is directly over the plate on the barbell. Grab the handle in both hands.", "equipment_required": ["T-Bar machine", "plates"], "execution": {"main": "Keeping your posture still, pull the handles so that the plate rises towards your chest. Pause just before it touches, and then slowly lower it back down.", "steps": []}}, "Barbell Bent Over Rows Supinated Grip": {"name": "Barbell Bent Over Rows Supinated Grip", "start_position": "Standing, your knees slightly bent. Grasp the bar with an underhand grip (supinated) with your hands at about shoulders width apart. Lean forward while keeping your back straight and your chest bulged.", "equipment_required": ["Bar", "plates"], "execution": {"main": "Pull the bar towards your belly button. Squeeze your back at the top of the movement, driving your shoulders and elbows behind the body. Then, slowly come back to the starting position. Keep your elbows tucked in throughout the movement.", "steps": []}}, "Pull Up": {"name": "Pull Up", "start_position": "Grasp the pull bar using a pronated grip, head slightly up, hands wider than shoulders width apart, and elbows slightly bent.", "equipment_required": ["Pull bar"], "execution": {"main": "Do a pull up by pulling your chin towards the bar. Then come back slowly to the starting position. Your segments’ length, your strength, and your shoulders’ mobility will determine how high you can pull yourself up.", "steps": []}}, "Behind the Neck Pull Up": {"name": "Behind the Neck Pull Up", "start_position": "Grasp the pull bar using a pronated grip, head slightly up, hands wider than shoulders width apart, and elbows slightly bent.", "equipment_required": ["Pull bar"], "execution": {"main": "Do a pull up by pulling your head in front of the bar. Then come back slowly to the starting position. Your segments’ length, your strength, and your shoulders’ mobility will determine how high you can pull yourself up.", "steps": []}}, "Pull Up with a Supinated Grip": {"name": "Pull Up with a Supinated Grip", "start_position": "Grasp the pull bar using an underhand (supinated) grip, head slightly up, hands about shoulders-width apart, elbows slightly bent and pointing forward.", "equipment_required": ["Pull bar"], "execution": {"main": "Do a pull up by pulling your chin towards the bar. Then come back slowly to the starting position. Your segments’ length, your strength, and your shoulders’ mobility will determine how high you can pull yourself up.", "steps": []}}, "Straight Arm Lat Pulldown": {"name": "Straight Arm Lat Pulldown", "start_position": "Standing, facing the high pulley cable machine, with your knees slightly bent, your torso bending over, back straight and your chest bulged. Grasp the bar with an overhand (pronated, palms facing down) grip with the elbow slightly bent.", "equipment_required": ["Straight bar", "high pulley cable"], "execution": {"main": "Pull the bar towards your hips while making an arc. Contract your lats by squeezing together your shoulder blades, and then slowly come back to the starting position.", "steps": []}}, "Dumbbell Bent Over Rows": {"name": "Dumbbell Bent Over Rows", "start_position": "Standing, your knees slightly bent. Grasp the dumbbells with a neutral grip (palms facing each other). Lean forward while keeping your back straight and your chest bulged.", "equipment_required": ["Dumbbells"], "execution": {"main": "Pull the dumbbells towards your hips. Squeeze your back at the top of the movement, driving your shoulders and elbows behind the body. Then, slowly come back to the starting position. Keep your elbows tucked in throughout the movement.", "steps": []}}, "Dumbbell Pullover": {"name": "Dumbbell Pullover", "start_position": "Upper back resting crossways on the bench (see illustration). Feet on the ground, shoulder width apart, pelvis slightly lower than the height of the bench. Hold the dumbbell with both hands above your chest, with your arms almost fully extended.", "equipment_required": ["Dumbbell", "bench"], "execution": {"main": "While keeping your elbows slightly bent, slowly lower the dumbbell behind your head in an arc. When your arms reach your head level, slowly go back to the starting position.", "steps": []}}, "Barbell Pullover": {"name": "Barbell Pullover", "start_position": "Lying on a bench, feet on the ground at shoulder width apart. Hold the barbell with your hands in pronation above your chest, arms almost fully extended.", "equipment_required": ["Barbell", "bench"], "execution": {"main": "With your elbows slightly bent, slowly lower the barbell behind your head in an arc. Once your arms are at your head level, slowly go back to the starting position.", "steps": []}}, "Barbell Deadlift": {"name": "Barbell Deadlift", "start_position": "Barbell placed on the ground in front of you. Feet a little less than shoulder width apart with your knees bent. With your arms fully extended, grab the barbell in pronation, hands shoulder-width apart Keep your torso slightly bent forward, back straight, shoulders pulled back and chest out. Inhale and tighten your abdominal muscles.", "equipment_required": ["Barbell", "plates"], "execution": {"main": "While keeping your arms straight, lift the barbell by extending your legs and straightening your torso to reach a vertical position. Exhale at the end of the motion. Then slowly go back to the starting position. Always remember never to bend your back.", "steps": []}}, "Barbell Sumo Deadlift": {"name": "Barbell Sumo Deadlift", "start_position": "Barbell placed on the ground in front of you. Legs apart and feet in an outward pointing position while remaining aligned with your knees. Legs bent, thighs almost horizontal (depending on your morphology). Barbell grip in pronation, with hands shoulder-width apart. Torso slightly bent forward, back straight, shoulders pulled back and chest out. Inhale and tighten your abdominal muscles.", "equipment_required": ["Barbell", "plates"], "execution": {"main": "While keeping your arms straight, lift the barbell by extending your legs and straightening your torso to reach a vertical position. Exhale at the end of the motion. Then slowly go back to the starting position. Always remember never to bend your back.", "steps": []}}, "Trap Bar Deadlift": {"name": "Trap Bar Deadlift", "start_position": "Standing inside the trap barbell, with your feet a little less than shoulder width apart, and your knees bent. Grab the trap barbell handles. Torso slightly bent forward, back straight, shoulders pulled back and chest out. Inhale and tighten your abdominal muscles.", "equipment_required": ["Trap barbell", "plates"], "execution": {"main": "While keeping your arms straight, lift the barbell by extending your legs and straightening your torso to reach a vertical position. Exhale at the end of the motion. Then slowly go back to the starting position. Always remember never to bend your back.", "steps": []}}, "Dumbbell Deadlift": {"name": "Dumbbell Deadlift", "start_position": "Dumbbells on the ground on both sides of you. Your feet a little less than shoulder width apart, knees bent. Grab the dumbbells in a neutral grip. Torso slightly bent forward, back straight, shoulders pulled back and chest out. Inhale and tighten your abdominal muscles.", "equipment_required": ["Dumbbells"], "execution": {"main": "While keeping your arms outstretched, lift the dumbbells by extending your legs and straightening your torso to reach a vertical position. Exhale at the end of the motion. Then, slowly go back to the starting position. Always remember never to bend your back.", "steps": []}}, "Barbell Shrug": {"name": "Barbell Shrug", "start_position": "Standing, holding the bar in front of you, pronation grip, hands shoulder-width apart.", "equipment_required": ["Barbell"], "execution": {"main": "Keeping your arms outstretched, raise your shoulders as high as possible. Contract your trapezius muscles at the top of the movement, then slowly return to the initial position.", "steps": []}}, "Dumbbell Shrugs": {"name": "Dumbbell Shrugs", "start_position": "Standing, arms stretched out along the body, one dumbbell in each hand.", "equipment_required": ["Dumbbells"], "execution": {"main": "Keeping your arms outstretched, raise your shoulders as high as possible. Contract your trapezius muscles at the top of the movement, then slowly return to the initial position.", "steps": []}}}