{"Barbell Bench Press": {"name": "Barbell Bench Press", "start_position": "Lying on the bench, your feet flat on the floor. Grasp the bar with a grip wider than shoulder width. Your forearms should be perpendicular to the floor.", "equipment_required": ["Barbell", "Bench"], "execution": {"main": "Unhook the bar and slowly lower it to the lower part of your chest. As you contract your pectorals, push the load upwards until your arms are almost straight.", "steps": ["Keep your elbows on the outside to put maximum stress on your chest and minimum stress on your anterior deltoids and triceps.", "Keep your shoulders flat against the bench."]}}, "Incline Dumbbell Bench Press": {"name": "Incline Dumbbell Bench Press", "start_position": "Lying on the sloping bench, your feet flat on the ground, one dumbbell in each hand, pronation grip. Hold the dumbbells at your sides at chest height. Your forearms should be perpendicular to the ground.", "equipment_required": ["Dumbbells", "Bench"], "execution": {"main": "While contracting your pectorals, push the load upwards until your arms are almost straight, then return to the initial position.", "steps": ["Keep your elbows on the outside to put maximum stress on your pectorals and minimum stress on your anterior deltoids and triceps.", "Keep your shoulders flat against the bench."]}}, "Peck Deck": {"name": "Peck Deck", "start_position": "Sitting on the \"Peck deck\" machine with your back pressed against the backrest, your forearms well supported against the padded parts provided for this purpose. Your upper arms should be parallel to the ground and in line with your shoulders.", "equipment_required": ["Peck Deck machine"], "execution": {"main": "Tighten your arms as much as possible following the movement of the machine. Tighten your chest at the end of the movement and then slowly return to the initial position.", "steps": []}}, "Cable Crossover": {"name": "Cable Crossover", "start_position": "Grasp the handles attached to the ends of each rope and stand in the middle between the pulleys. Bend your chest slightly forward and keep your elbows slightly bent.", "equipment_required": ["Cable Crossover machine"], "execution": {"main": "Slowly tighten your arms in front of your chest in an arc. Keep your elbows slightly bent during the movement. When your hands come together, hold the position for a moment, contracting your chest. Then slowly return to the original position.", "steps": []}}, "Incline Barbell Bench Press": {"name": "Incline Barbell Bench Press", "start_position": "Lying on the sloping bench with your feet flat on the floor. Grasp the bar with a grip wider than shoulder width. Your forearms should be perpendicular to the ground.", "equipment_required": ["Barbell", "Bench Press"], "execution": {"main": "Unhook the bar and slowly lower it to the top of your chest. As you contract your pectorals, push the load upwards until your arms are almost straight.", "steps": ["Keep your elbows on the outside to put maximum stress on your chest and minimum stress on your anterior deltoids and triceps.", "Keep your shoulders flat against the bench."]}}, "Dumbbell Bench Press": {"name": "Dumbbell Bench Press", "start_position": "Lying on the bench, your feet flat on the floor, one dumbbell in each hand, pronation grip. Hold the dumbbells at your sides at chest height. Your forearms should be perpendicular to the ground.", "equipment_required": ["Dumbbells", "Bench"], "execution": {"main": "By contracting your pectorals, push the load against upwards until your arms are almost extended, then return to the initial position.", "steps": []}}, "Dumbbell Fly": {"name": "Dumbbell Fly", "start_position": "Lying on the bench, your feet flat on the floor, one dumbbell in each hand. Hold the weights in a neutral grip, arms outstretched above your chest.", "equipment_required": ["Dumbbells", "Bench"], "execution": {"main": "Slowly lower the dumbbells to the sides in an arc with your arms until you feel a stretch in your pectorals. Do not go below shoulder level. Then return to the original position, performing the same arc.", "steps": ["Keep your elbows pointed outward and slightly bent to reduce stress on the joint.", "Keep your shoulders flat against the bench."]}}, "Incline Dumbbell Fly": {"name": "Incline Dumbbell Fly", "start_position": "Lying on the sloping bench, your feet flat on the floor, one dumbbell in each hand. Hold the weights in a neutral grip with your arms outstretched above your chest.", "equipment_required": ["Dumbbells", "Bench"], "execution": {"main": "Slowly lower the dumbbells to the sides in an arc with your arms until you feel a stretch in your pectorals. Do not go below shoulder level. Then return to the original position, making the same arc.", "steps": ["Keep your elbows pointed outward and slightly bent to reduce stress on the joint.", "Keep your shoulders flat against the bench."]}}, "Chest Press Machine": {"name": "Chest Press Machine", "start_position": "Set the chest press machine up so that when sitting down the handles are in line with the lower part of your chest. Make sure that you are sitting right back up against the seat. Grab hold of a handle in each hand, push your chest out, keep your head against the headrest.", "equipment_required": ["Chest Press machine"], "execution": {"main": "Take a deep breath, and slowly push the handles forward until your arms are almost completely extended. Pause just before lockout, and then slowly return the handles back to the start position. Pausing just before the handles stop completely and repeating for another rep.", "steps": []}}, "Barbell Declined Bench Press": {"name": "Barbell Declined Bench Press", "start_position": "Lying on the declined bench, with your legs pressed against the pads. Holding the barbell with a grip wider than the width of your shoulders, with your hands in pronation. Your forearms should be perpendicular to the ground.", "equipment_required": ["Barbell", "declined bench", "plates"], "execution": {"main": "Release the barbell and slowly lower it to the lower part of your pectorals. While contracting your chest muscles, push the weighted barbell upwards until your arms are almost stretched out.", "steps": ["Keep your elbows on the outside in order to strain your chest muscles as much as possible and your anterior deltoids and triceps as little as possible.", "Keep your shoulders pressed against the bench."]}}, "Dumbbell Declined Bench Press": {"name": "Dumbbell Declined Bench Press", "start_position": "Lying on the declined bench, one dumbbell in each hand, pronation grip. Hold the dumbbells on the sides at chest height, elbows on the outside. Your forearms should be perpendicular to the ground.", "equipment_required": ["Dumbbells", "declined bench", "plates"], "execution": {"main": "While contracting your pectorals, push the dumbbells upwards until your arms are almost stretched out, and then go back to the starting position.", "steps": ["Keep your elbows on the outside to make sure your pectorals are fully engaged and your anterior deltoids and triceps are minimally engaged.", "Keep your shoulders pressed against the bench."]}}, "Push Ups": {"name": "Push Ups", "start_position": "Face down, arms outstretched, hands wide apart, resting on the floor and aligned with your pectoral muscles. Legs stretched and face pointed towards the ground.", "execution": {"main": "Slowly bend your arms, letting your chest come closer to the ground, until your elbows form a 90 degrees angle. Then return to the starting position by pushing on your hands.", "steps": []}}}