{"Dumbbell Shoulder Press": {"name": "Dumbbell Shoulder Press", "start_position": "Sitting on a bench with your back well supported against the backrest. Hold the dumbbells in your hands (pronation grip) a little above shoulder height. Your elbows are on the outside and your forearms are perpendicular to the ground.", "equipment_required": ["Dumbbells", "bench"], "execution": {"main": "Push the dumbbells upwards. Until your arms are fully extended. Then return to the original position.", "steps": []}}, "Dumbbell Lateral Raise": {"name": "Dumbbell Lateral Raise", "start_position": "Standing with feet about shoulder width apart, arms along the body and a dumbbell in each hand", "equipment_required": ["Dumbbells"], "execution": {"main": "Slowly raise the arms sideways to the horizontal, keeping the elbows slightly bent. Contract your deltoids for a moment in the high position, then slowly return to the initial position.", "steps": []}}, "Dumbbell Front Raise": {"name": "Dumbbell Front Raise", "start_position": "Standing with feet about shoulder width apart, one dumbbell in each hand (pronation grip).", "equipment_required": ["Dumbbells"], "execution": {"main": "Slowly raise the arms forward until they are parallel to the ground. Contract your deltoids for a moment in the raised position, then slowly return to the initial position.", "steps": []}}, "High Cable Rear Delt Fly": {"name": "High Cable Rear Delt Fly", "start_position": "Standing between the pulleys with the right handle in the left hand and the left handle in the right hand. Your arms folded in front of you at shoulder height.", "equipment_required": ["Cable machine"], "execution": {"main": "Tightening your posterior deltoids and keeping your arms almost straight, pull your elbows as far back as possible in an arc. Stay in this position for a moment before returning to the initial position.", "steps": []}}, "Smith Machine Shoulder Press": {"name": "Smith Machine Shoulder Press", "start_position": "Sitting on a bench with your back well supported against the backrest. Position the bench so that the bar drops just in front of your face. Grasp the bar with your hands in pronation. Your back is well supported against the backrest, your elbows are on the outside and your forearms are perpendicular to the ground.", "equipment_required": ["Smith machine"], "execution": {"main": "Unhook the bar and slowly bring it to the height of your chin. Contract your shoulders by pushing the load upwards. Stop the movement just before your arms are fully extended. Then return to the down position.", "steps": []}}, "Barbell Upright Row": {"name": "Barbell Upright Row", "start_position": "Standing, holding the bar in front of you, pronation grip, hands shoulder-width apart.", "equipment_required": ["Barbell"], "execution": {"main": "Lift the bar vertically to chest height. Contract for a moment, then return to the starting position. During the whole movement, keep the bar close to the body and the elbows higher than the wrists.", "steps": []}}, "Bent-Over Lateral Raise": {"name": "Bent-Over Lateral Raise", "start_position": "Standing with knees slightly bent, bust bent forward, almost parallel to the ground, keeping your back straight and your head in line with your spine. Hold a dumbbell in each hand, palms facing each other.", "equipment_required": ["Dumbbells"], "execution": {"main": "Slowly lift and move the dumbbells away from each side of your body in an arc with your arms. Contract for a moment in the raised position before returning to the initial position.", "steps": []}}, "Cable One-Arm Lateral Raise": {"name": "Cable One-Arm Lateral Raise", "start_position": "Stand with your feet shoulder-width apart, your left side close to the pulley. The handle in your right hand, against the front of your thigh.", "equipment_required": ["Cable machine"], "execution": {"main": "Slowly raise your arm to the side in an arc to the horizontal. Keep your elbow slightly bent. Stay in the raised position for a moment and then slowly return to the original position.", "steps": []}}, "Dumbbell Push Press": {"name": "Dumbbell Push Press", "start_position": "Stand upright with a dumbbell resting on each shoulder and elbows pointed out in front of you. Feet should be shoulder width apart.", "equipment_required": ["Dumbbells"], "execution": {"main": "Bend knees slightly and then drive upwards, pushing the dumbbells straight up in the air and finishing with arms extended above your head. Pause, and then return to starting position.", "steps": []}}, "Barbell Push Press": {"name": "Barbell Push Press", "start_position": "Stand upright with a barbell resting on your upper chest and shoulders and elbows pointed out in front of you. Feet should be shoulder width apart.", "equipment_required": ["Barbell"], "execution": {"main": "Bend knees slightly and then drive upwards, pushing the barbell straight up in the air and finishing with arms extended above your head. Pause, and then return to starting position.", "steps": []}}, "Single-Arm Cable Front Raise": {"name": "Single-Arm Cable Front Raise", "start_position": "Standing, your back facing the cable machine, with your knees slightly bent. Grasp the handle with an overhand (pronated), your arm along your body with the elbow slightly bent.", "equipment_required": ["Grip handle", "low pulley cable"], "execution": {"main": "While keeping your elbow slightly bent, slowly raise forward your arm while making an arc. Once the arm is parallel with the floor squeeze briefly your shoulders, and then slowly come back to the starting position. Repeat for desired reps.", "steps": []}}, "Barbell Front Raise": {"name": "Barbell Front Raise", "start_position": "Standing, your feet about shoulders width apart, elbows slightly bent, arms along the body, grasp the handle with an overhand (pronated) grip, hands shoulders width apart.", "equipment_required": ["Bar", "plates"], "execution": {"main": "Slowly raise your arms forward until they are parallel with the floor. Squeeze briefly your shoulders at the top and then slowly come back to the starting position. Keep your back straight throughout the movement.", "steps": []}}, "Seated Barbell Shoulder Press": {"name": "Seated Barbell Shoulder Press", "start_position": "Sit down on the bench and unrack the bar using an overhand (pronated) grip, your elbows pointing outward. The bar stands in front of you at chin’s level. This level may vary depending on your shoulders’ flexibility. The gap between your hands should be such that your elbows are forming a 90° angle when your arms are parallel to the floor.", "equipment_required": ["Bar", "plates", "bench"], "execution": {"main": "Squeeze your shoulders while pressing the weight vertically. Stop the movement when your arms are about to be fully outstretched. Then, come back slowly to the starting position.", "steps": []}}, "Seated Behind the Neck Barbell Shoulder Press": {"name": "Seated Behind the Neck Barbell Shoulder Press", "start_position": "Sit down on the bench with your back straight and your chest bulged. Unrack the bar using an overhand (pronated) grip, your elbows pointing outward. The bar stands behind you at neck’s level. This level may vary depending on your shoulders’ flexibility. The gap between your hands should be such that your elbows are forming a 90° angle when your arms are parallel to the floor.", "equipment_required": ["Bar", "plates", "bench"], "execution": {"main": "Squeeze your shoulders while pressing the weight vertically. Stop the movement when your arms are about to be fully outstretched. Then, come back slowly to the starting position.", "steps": []}}, "Standing Barbell Shoulder Press": {"name": "Standing Barbell Shoulder Press", "start_position": "Standing with your back straight, chest bulged, feet about shoulders width apart, and knees slightly bent. Grasp the bar using a pronated grip, your elbows pointing outward. The bar stands at chin’s level. This level may vary depending on your shoulders’ flexibility. The gap between your hands should be such that your elbows are forming a 90° angle when your arms are parallel to the floor.", "equipment_required": ["Bar", "plates"], "execution": {"main": "Squeeze your shoulders while pressing the weight vertically. Stop the movement when your arms are about to be fully outstretched. Then, come back slowly to the starting position.", "steps": []}}, "Standing Behind the Neck Barbell Shoulder Press": {"name": "Standing Behind the Neck Barbell Shoulder Press", "start_position": "Standing with your back straight, chest bulged, feet about shoulders width apart, and knees slightly bent. Grasp the bar using a pronated grip, your elbows pointing outward. The bar stands behind you at neck’s level. This level may vary depending on your shoulders’ flexibility. The gap between your hands should be such that your elbows are forming a 90° angle when your arms are parallel to the floor.", "equipment_required": ["Bar", "plates"], "execution": {"main": "Squeeze your shoulders while pressing the weight vertically. Stop the movement when your arms are about to be fully outstretched. Then, come back slowly to the starting position.", "steps": []}}, "Alternate Dumbbell Front Raise Neutral Grip": {"name": "Alternate Dumbbell Front Raise Neutral Grip", "start_position": "Standing, arms along the body, elbows slightly bent, one dumbbell in each hand, neutral grip.", "equipment_required": ["Dumbbells"], "execution": {"main": "Slowly lift one arm forward in an arc until it is parallel to the ground. Squeeze your anterior deltoid for a moment, and then slowly go back to the starting position. Do the same with the other arm. Keep your back straight during the exercise.", "steps": []}}, "One-Arm Low-Pulley Front Raise Neutral Grip": {"name": "One-Arm Low-Pulley Front Raise Neutral Grip", "start_position": "Standing with back turned to the pulley. Holding the end of the rope, hand in neutral grip, arms along your body, elbow slightly bent.", "equipment_required": ["Lower pulley"], "execution": {"main": "Keeping your elbow slightly bent, slowly lift your arm forward in an arc. Once your arm is parallel to the ground, squeeze your anterior deltoid for a moment and then go back to your starting position. Keep your back straight during the exercise.", "steps": []}}, "Two-Handed Dumbbell Front Raise": {"name": "Two-Handed Dumbbell Front Raise", "start_position": "Standing with feet about shoulder width apart, elbows slightly bent, arms alongside the body, holding the dumbbell with both hands (as illustrated).", "equipment_required": ["Dumbbell"], "execution": {"main": "Slowly lift the arms forward in an arc until they are parallel to the ground. Squeeze your deltoids for a moment, and then slowly go back to your starting position. Keep your back straight during the exercise.", "steps": []}}}