{"Barbell Curl": {"name": "Barbell Curl", "start_position": "Standing with knees slightly bent and back straight. Hold the bar with your hands in supination, about shoulder width apart.", "equipment_required": ["EZ Barbell"], "execution": {"main": "Without making a bust movement, raise the bar by bending the forearms. Contract your biceps in the high position, then let the bar slowly come down to the initial position. Keep your elbows close to your body during the movement.", "steps": []}}, "Alternating Dumbbell Curl": {"name": "Alternating Dumbbell Curl", "start_position": "Standing with knees slightly bent and back straight. Hold a dumbbell in each hand, in a neutral grip along the body.", "equipment_required": ["Dumbbells"], "execution": {"main": "Without making a bust movement, raise a dumbbell by bending the forearm. During the movement, rotate your wrist outwards until your hand is supine in the upright position. Contract your biceps, then slowly return to the initial position. Keep your elbow close to your body during the movement. Alternate this movement one arm after the other.", "steps": []}}, "Rope Cable Curl": {"name": "Rope Cable Curl", "start_position": "Standing in front of the pulley, knees slightly bent, grasp the rope with both hands, in neutral grip, arms relaxed along the body.", "equipment_required": ["Cable machine", "rope"], "execution": {"main": "Without making a bust movement, bend your forearms, bringing your hands as close as possible to your shoulders, without bringing your elbows too far forward. Contract your biceps in a high position, then slowly return to the initial position.", "steps": []}}, "EZ Barbell Curl": {"name": "EZ Barbell Curl", "start_position": "Standing with knees slightly bent and back straight. Hold the EZ bar with your hands in supination.", "equipment_required": ["EZ Barbell"], "execution": {"main": "Without making a movement of bust, raise the EZ bar by bending the forearms. Contract your biceps in high position, then let the bar slowly come down again in the initial position. Keep your elbows close to your body during the movement.", "steps": []}}, "EZ Barbell Preacher Curl": {"name": "EZ Barbell Preacher Curl", "start_position": "Sitting or standing, adjust the \"Larry Scott\" armrest so that it is slightly below the level of your shoulders. Rest your upper arms on the armrest and grasp the EZ bar with your hands in supination.", "equipment_required": ["Preacher bench", "EZ Barbell"], "execution": {"main": "Slowly bend your forearms towards your shoulders while keeping your upper arms pressed against the armrest. Contract your biceps in the up position, then slowly return to the initial position. Be careful not to fully extend your forearms in the lowered position to avoid putting too much strain on the elbow joint.", "steps": []}}, "Hammer Curl": {"name": "Hammer Curl", "start_position": "Standing with knees slightly bent and back straight. Hold a dumbbell in each hand, in a neutral grip along the body.", "equipment_required": ["Dumbbells"], "execution": {"main": "Without making a bust movement, raise a dumbbell by bending the forearms. Keep your hand in a neutral grip (hence the name hammer grip). Contract your biceps, then slowly return to the initial position. Keep your elbow close to your body during the movement. Alternate this movement one arm after the other.", "steps": []}}, "Incline Dumbbell Curl": {"name": "Incline Dumbbell Curl", "start_position": "Sitting on a bench with the backrest tilted at an angle of 40 to 60 degrees. Let your arms hang down towards the floor. Hold a dumbbell in each hand in supination.", "equipment_required": ["Dumbbells", "bench"], "execution": {"main": "Keeping your back well against the backrest, raise a dumbbell by bending your forearm towards your shoulder. Contract your biceps in the high position, then slowly return to the initial position. Keep your elbow close to your body during the movement. Alternate this movement one arm after the other.", "steps": []}}, "Dumbbell Concentration Curl": {"name": "Dumbbell Concentration Curl", "start_position": "Sitting on a bench, hold a dumbbell in your right hand, supine grip. With your chest slightly bent forward, rest your elbow on the inside of your right thigh, leaving your arm relaxed towards the ground.", "equipment_required": ["Dumbbell", "bench"], "execution": {"main": "Slowly bend your forearm as you bring the dumbbell towards your right shoulder. Contract your biceps in the high position, then slowly return to the initial position. Once your series is completed, move to the other arm.", "steps": []}}, "Single-Arm Low Pulley Cable Curl": {"name": "Single-Arm Low Pulley Cable Curl", "start_position": "Stand in front of the cable machine and grasp the handle with an underhand (supinated) grip. The knees should be slightly bent and your arm relaxed along your body.", "equipment_required": ["Grip handle", "low pulley cable"], "execution": {"main": "Keeping your torso fixed, elbow tucked in at your side, and eyes facing forward, slowly curl the weight up as far as possible without letting the elbow move forward excessively; only your forearm should be moving. Squeeze the biceps at the top of the movement, and then slowly lower the weight back to the starting position. Repeat for desired reps and then repeat for the other arm.", "steps": []}}, "Straight Bar Low Pulley Cable Curl": {"name": "Straight Bar Low Pulley Cable Curl", "start_position": "Stand in front of the cable machine, legs shoulder width apart, and grasp the straight bar with an underhand (supinated) grip and your hands about shoulder width apart.", "equipment_required": ["Straight bar", "low pulley cable"], "execution": {"main": "Keeping your body fixed, elbow tucked in at your side, and eyes facing forward, slowly curl the weight up as far as possible without letting the elbow move forward excessively; only your forearms should be moving. Squeeze the biceps at the top of the movement, and then slowly lower the weight back to the starting position. Repeat for desired reps.", "steps": []}}, "Standing High Pulley Cable Curl": {"name": "Standing High Pulley Cable Curl", "start_position": "grasp each of the cables with an underhand grip (supinated, palms facing up) and stand in the center with your arms outstretched.", "equipment_required": ["2 grip handles", "2 low pulley cables"], "execution": {"main": "Keeping your upper arms and body fixed, curl simultaneously the handles in towards your head as far as possible. Squeeze your biceps at the top of the movement, pause, and then slowly lower the weight back to the starting position. Repeat for desired reps.", "steps": []}}, "Seated Barbell Wrist Curl": {"name": "Seated Barbell Wrist Curl", "start_position": "Grasp a barbell using an underhand grip (supinated, palms facing up) and sit down on the end of a flat bench. Rest the back of your forearms on the top of your thighs or on the end of the bench so that your wrists are just off the end of your knees or of the bench.", "equipment_required": ["Bar", "plates", "bench"], "execution": {"main": "Without moving the forearms, slowly raise your hands up as far as possible squeezing the forearms muscles at the top of the movement. Pause, and then slowly lower the barbell back to the starting position. Repeat for desired reps.", "steps": []}}, "Seated Barbell Wrist Extension": {"name": "Seated Barbell Wrist Extension", "start_position": "Grasp a barbell using an overhand grip (pronated, palms facing down) and sit down on the end of a flat bench. Rest your forearms on the top of your thighs or on the end of the bench so that your wrists are just off the end of your knees or of the bench.", "equipment_required": ["Bar", "plates", "bench"], "execution": {"main": "Without moving the forearms, slowly raise your hands up as far as possible squeezing the forearms muscles at the top of the movement. Pause, and then slowly lower the barbell back to the starting position. Repeat for desired reps.", "steps": []}}, "Reverse Barbell Curl": {"name": "Reverse Barbell Curl", "start_position": "Stand in front of the cable machine, knees slightly bent and back straight, grasp the straight or EZ-bar with an overhand (pronated) grip and your hands about shoulder width apart.", "equipment_required": ["Straight bar or EZ bar", "plates"], "execution": {"main": "Without moving the torso, slowly raise your forearms up as far as possible squeezing them at the top of the movement, pause, and then slowly lower the barbell back to the starting position. Keep the elbows tucked in throughout the movement. Repeat for desired reps.", "steps": []}}}