{"Lying Triceps Extension": {"name": "Lying Triceps Extension", "start_position": "Lying on the bench, your feet flat on the floor or on the bench. Hold the EZ bar above your chest, pronated grip, hands slightly tighter than shoulder width.", "equipment_required": ["EZ Barbell", "Bench"], "execution": {"main": "Slowly bend your forearms without spreading your elbows too far apart, bringing the bar to the top of your head. Then return to the initial position.", "steps": []}}, "Triceps Pressdown": {"name": "Triceps Pressdown", "start_position": "Standing facing the pulley, grasping the bar with a pronation grip, hands shoulder width apart.", "equipment_required": ["Cable Machine", "Pressdown Bar"], "execution": {"main": "Carry out an extension of the forearms until your arms are fully extended. In this position, contract your triceps for a moment and then slowly return to the initial position. Keep your elbows close to your body during the whole movement.", "steps": []}}, "Cable Rope Pushdown": {"name": "Cable Rope Pushdown", "start_position": "Standing in front of the pulley, grasp one end of the rope in each hand in neutral grip.", "equipment_required": ["Cable machine", "rope"], "execution": {"main": "Extend your forearms by spreading the ends of the rope slightly apart until your arms are fully extended. In this position, contract your triceps for a moment and then slowly return to the initial position. Keep your elbows close to your body during the whole movement.", "steps": []}}, "Dumbbell Overhead Triceps Extension": {"name": "Dumbbell Overhead Triceps Extension", "start_position": "Sitting on a bench, back straight, grasping a dumbbell with both hands, palms against the inside of a disc (see picture). Position the dumbbell above your head, arms outstretched, triceps well contracted.", "equipment_required": ["Dumbbell", "Bench"], "execution": {"main": "Lower your forearms behind your head until your elbows form a 90° angle. Then extend the forearms, returning to the initial position.", "steps": []}}, "Close Grip Bench Press": {"name": "Close Grip Bench Press", "start_position": "Lying on the bench, your feet flat on the floor. Grasp the bar with a pronation grip, hands slightly tighter than shoulder width.", "equipment_required": ["EZ Barbell", "Bench"], "execution": {"main": "Unhook the bar and slowly lower it to the lower part of your chest. Then push the load upwards until your arms are straight.", "steps": ["Keep your elbows pressed against your body to put maximum strain on your triceps and protect your elbow joint.", "Keep your shoulders flat against the bench."]}}, "Kickback": {"name": "Kickback", "start_position": "Place your left knee and left hand on a bench, with your chest parallel to the floor. Keep your right foot on the ground and grasp the dumbbell in your right hand. Keeping it close to your body, raise the top of your right arm until it is parallel to the ground.", "equipment_required": ["Dumbbell", "Bench"], "execution": {"main": "Perform an extension of the right arm. When it is fully extended, contract your triceps for a moment before returning to the initial position. Once you have completed your series, do the same with the other arm.", "steps": []}}, "Reverse Grip Cable Triceps Extension with Barbell": {"name": "Reverse Grip Cable Triceps Extension with Barbell", "start_position": "Stand in front of the cable machine and grasp the straight bar with an underhand (supinated, palms facing up) grip, hands about shoulders width apart, elbows tucked in and bent at a bit less than a 90° angle.", "equipment_required": ["Straight bar", "high pulley cable"], "execution": {"main": "Extend the forearms until your arms are completely stretched. In this position, squeeze your triceps, pause, and then slowly come back to the starting position. Keep the elbows tucked in throughout the movement. Repeat for desired reps.", "steps": []}}, "Single-Arm Cable Triceps Extension": {"name": "Single-Arm Cable Triceps Extension", "start_position": "Stand in front of the cable machine and grasp the handle with an overhand (pronated, palm facing down) grip, elbows tucked in and bent at a bit less than a 90° angle.", "equipment_required": ["Grip handle", "high pulley cable"], "execution": {"main": "Extend the forearms until your arm is completely stretched. In this position, squeeze your triceps, pause, and then slowly come back to the starting position. Keep the elbows tucked in throughout the movement. Repeat for desired reps and then repeat for the other arm.", "steps": []}}, "Single-Arm Cable Triceps Extension with Supinated Grip": {"name": "Single-Arm Cable Triceps Extension with Supinated Grip", "start_position": "Stand in front of the cable machine and grasp the handle with an underhand (supinated, palm facing up) grip, elbows tucked in and bent at a bit less than a 90° angle.", "equipment_required": ["Grip handle", "high pulley cable"], "execution": {"main": "Extend the forearms until your arm is completely stretched. In this position, squeeze your triceps, pause, and then slowly come back to the starting position. Keep the elbows tucked in throughout the movement. Repeat for desired reps and then repeat for the other arm.", "steps": []}}, "Lying Dumbbell Triceps Extension": {"name": "Lying Dumbbell Triceps Extension", "start_position": "Lay back on the bench with your feet firmly on the ground or on the bench. Grab a dumbbell in each hand using a neutral grip (palms facing each other) with your arms extended above your chest.", "equipment_required": ["Dumbbells", "bench"], "execution": {"main": "Lower slowly your forearms, while keeping your elbows tucked in as much as possible, until they reach your forehead. Then slowly come back to the starting position. Repeat for desired reps.", "steps": []}}, "Seated Barbell French Press": {"name": "Seated Barbell French Press", "start_position": "Sit on an upright bench, back firmly against the bench’s back rest, and grab a straight-bar or an EZ-bar with your hands slightly narrower than shoulders width apart. The bar or EZ-bar should be above your head with your arms outstretched and your triceps squeezed.", "equipment_required": ["Straight bar or EZ bar", "plates", "bench"], "execution": {"main": "Lower slowly your forearms beyond your head until your elbows are at a 90° angle. Then slowly come back to the starting position and squeeze your triceps at the top. Keep your back straight throughout the movement. Repeat for desired reps.", "steps": []}}, "Bench Dips": {"name": "Bench Dips", "start_position": "Set up for the bench dip by placing two flat benches parallel to one another to around your legs’ length. Keeping your back straight and your arms outstretched, place your hands on the edge of one bench at about shoulder’s width and put your heels on the edge of the other bench, legs and buttocks swinging in the air (see picture).", "equipment_required": ["2 benches"], "execution": {"main": "While keeping your elbows tucked in, slowly flex them until they are at a 90° angle. Then slowly come back to the starting position and squeeze your triceps at the top. Keep your back straight throughout the movement. Repeat for desired reps.", "steps": []}}, "Parallel Dip Bar": {"name": "Parallel Dip Bar", "start_position": "Grasp the two parallel bars, arms outstretched along your torso and knees bent and swinging in the air (see picture).", "equipment_required": ["Parallel bars"], "execution": {"main": "While keeping your elbows tucked in, slowly flex them until they are at a 90° angle. Then slowly come back to the starting position and squeeze your triceps at the top. Don’t lean forward to prevent the tension from being placed on your pecs. Repeat for desired reps.", "steps": []}}}